
## :white_check_mark: Apply Succeeded

[CI link](https://github.com/mongulu-cm/mtchoun-mouh/actions/runs/10634007631)



<pre><code>Apply complete! Resources: 1 added, 4 changed, 0 destroyed.</code></pre>

<details><summary>Details (Click me)</summary>

```hcl
Running apply in the remote backend. Output will stream here. Pressing Ctrl-C
will cancel the remote apply if it's still pending. If the apply started it
will stop streaming the logs, but will not stop the apply running remotely.

Preparing the remote apply...

To view this run in a browser, visit:
https://app.terraform.io/app/tfc-mongulu-cm/mtchoun-mouh-refactor-use-textractor/runs/run-BGhK4WWPgNmfUGzK

Waiting for the plan to start...

Terraform v1.9.5
on linux_amd64
Initializing plugins and modules...
data.archive_file.lambda_zip: Reading...
data.archive_file.lambda_zip: Read complete after 0s [id=a302387976ce74579a87a903dcc6149f70895053]
data.aws_iam_role.role: Reading...
data.aws_caller_identity.current: Reading...
aws_dynamodb_table.Register: Refreshing state... [id=mtchoun-mouh-refactor-use-textractor-Register]
aws_api_gateway_rest_api.api: Refreshing state... [id=ihfbm9blp1]
aws_lambda_layer_version.test_lambda_layer: Refreshing state... [id=arn:aws:lambda:eu-central-1:053932140667:layer:test_lambda_layer:5]
aws_dynamodb_table.Users: Refreshing state... [id=mtchoun-mouh-refactor-use-textractor-Users]
aws_cloudwatch_event_rule.scheduler: Refreshing state... [id=mtchoun-mouh-refactor-use-textractor-trigger_user_scan]
aws_dynamodb_table.Link_table: Refreshing state... [id=mtchoun-mouh-refactor-use-textractor-Link_table]
aws_s3_bucket.website: Refreshing state... [id=mtchoun-mouh-refactor-use-textractor-mtchoun-mouh.mongulu.cm]
aws_s3_bucket.images: Refreshing state... [id=mtchoun-mouh-refactor-use-textractor-djansang]
data.aws_caller_identity.current: Read complete after 0s [id=053932140667]
data.aws_iam_role.role: Read complete after 0s [id=website-deployer]
aws_lambda_function.scan: Refreshing state... [id=mtchoun-mouh-refactor-use-textractor-scan_user_consulcam]
aws_lambda_function.lambda: Refreshing state... [id=mtchoun-mouh-refactor-use-textractor-user_registration_consulcam]
aws_api_gateway_resource.resource: Refreshing state... [id=spl6ny]
aws_api_gateway_method.method: Refreshing state... [id=agm-ihfbm9blp1-spl6ny-POST]
module.cors.aws_api_gateway_method._: Refreshing state... [id=agm-ihfbm9blp1-spl6ny-OPTIONS]
aws_lambda_permission.allow_cloudwatch_to_call_check_foo: Refreshing state... [id=AllowExecutionFromCloudWatch]
aws_cloudwatch_event_target.target: Refreshing state... [id=mtchoun-mouh-refactor-use-textractor-trigger_user_scan-lambda]
module.cors.aws_api_gateway_method_response._: Refreshing state... [id=agmr-ihfbm9blp1-spl6ny-OPTIONS-200]
module.cors.aws_api_gateway_integration._: Refreshing state... [id=agi-ihfbm9blp1-spl6ny-OPTIONS]
aws_api_gateway_method_response.method_response_200: Refreshing state... [id=agmr-ihfbm9blp1-spl6ny-POST-200]
aws_lambda_permission.apigw_lambda: Refreshing state... [id=AllowExecutionFromAPIGateway]
aws_api_gateway_integration.integration: Refreshing state... [id=agi-ihfbm9blp1-spl6ny-POST]
aws_api_gateway_deployment.test: Refreshing state... [id=dgv6dg]
module.cors.aws_api_gateway_integration_response._: Refreshing state... [id=agir-ihfbm9blp1-spl6ny-OPTIONS-200]
local_file.index_page: Refreshing state... [id=572e00d735b8577939cb9ec2de85ffe55d375db6]
aws_s3_bucket_public_access_block.website: Refreshing state... [id=mtchoun-mouh-refactor-use-textractor-mtchoun-mouh.mongulu.cm]
aws_s3_bucket_object.example_file: Refreshing state... [id=index.html]
aws_s3_bucket_policy.website: Refreshing state... [id=mtchoun-mouh-refactor-use-textractor-mtchoun-mouh.mongulu.cm]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # aws_lambda_function.lambda will be updated in-place
  ~ resource "aws_lambda_function" "lambda" {
        id                             = "mtchoun-mouh-refactor-use-textractor-user_registration_consulcam"
        tags                           = {
            "environment" = "mtchoun-mouh-master"
            "project"     = "mtchoun-mouh"
        }
        # (25 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              ~ "MAINTAINER_MAIL" = (sensitive value)
                # (8 unchanged elements hidden)
            }
        }

        # (1 unchanged block hidden)
    }

  # aws_lambda_function.scan will be updated in-place
  ~ resource "aws_lambda_function" "scan" {
        id                             = "mtchoun-mouh-refactor-use-textractor-scan_user_consulcam"
        tags                           = {
            "environment" = "mtchoun-mouh-master"
            "project"     = "mtchoun-mouh"
        }
        # (25 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              ~ "MAINTAINER_MAIL" = (sensitive value)
                # (8 unchanged elements hidden)
            }
        }

        # (1 unchanged block hidden)
    }

  # aws_s3_bucket.images will be updated in-place
  ~ resource "aws_s3_bucket" "images" {
        id                          = "mtchoun-mouh-refactor-use-textractor-djansang"
        tags                        = {
            "Name"        = "images"
            "environment" = "mtchoun-mouh-master"
            "project"     = "mtchoun-mouh"
        }
        # (11 unchanged attributes hidden)

      - server_side_encryption_configuration {
          - rule {
              - bucket_key_enabled = false -> null

              - apply_server_side_encryption_by_default {
                  - sse_algorithm     = "AES256" -> null
                    # (1 unchanged attribute hidden)
                }
            }
        }

        # (1 unchanged block hidden)
    }

  # aws_s3_bucket.website will be updated in-place
  ~ resource "aws_s3_bucket" "website" {
        id                          = "mtchoun-mouh-refactor-use-textractor-mtchoun-mouh.mongulu.cm"
        tags                        = {
            "Name"        = "Website"
            "environment" = "mtchoun-mouh-master"
            "project"     = "mtchoun-mouh"
        }
        # (13 unchanged attributes hidden)

      - server_side_encryption_configuration {
          - rule {
              - bucket_key_enabled = false -> null

              - apply_server_side_encryption_by_default {
                  - sse_algorithm     = "AES256" -> null
                    # (1 unchanged attribute hidden)
                }
            }
        }

        # (3 unchanged blocks hidden)
    }

  # local_file.index_page will be created
  + resource "local_file" "index_page" {
      + content              = (sensitive value)
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0777"
      + file_permission      = "0777"
      + filename             = "../html/index.html"
      + id                   = (known after apply)
    }

Plan: 1 to add, 4 to change, 0 to destroy.


------------------------------------------------------------------------

Cost estimation:

Resources: 3 of 5 estimated
           $1.74096/mo +$0.0

------------------------------------------------------------------------

aws_lambda_function.scan: Modifying... [id=mtchoun-mouh-refactor-use-textractor-scan_user_consulcam]
aws_lambda_function.lambda: Modifying... [id=mtchoun-mouh-refactor-use-textractor-user_registration_consulcam]
aws_s3_bucket.images: Modifying... [id=mtchoun-mouh-refactor-use-textractor-djansang]
aws_s3_bucket.website: Modifying... [id=mtchoun-mouh-refactor-use-textractor-mtchoun-mouh.mongulu.cm]
aws_s3_bucket.images: Modifications complete after 5s [id=mtchoun-mouh-refactor-use-textractor-djansang]
aws_s3_bucket.website: Modifications complete after 6s [id=mtchoun-mouh-refactor-use-textractor-mtchoun-mouh.mongulu.cm]
aws_lambda_function.scan: Modifications complete after 7s [id=mtchoun-mouh-refactor-use-textractor-scan_user_consulcam]
aws_lambda_function.lambda: Modifications complete after 7s [id=mtchoun-mouh-refactor-use-textractor-user_registration_consulcam]
local_file.index_page: Creating...
local_file.index_page: Creation complete after 0s [id=8a1d3219eb138360c457b764df18ac2e61bd0bef]

Apply complete! Resources: 1 added, 4 changed, 0 destroyed.

Outputs:

register_table = "mtchoun-mouh-refactor-use-textractor-Register"
stage_url = "https://ihfbm9blp1.execute-api.eu-central-1.amazonaws.com/mtchoun-mouh-refactor-use-textractor-dev"
website_url = "http://mtchoun-mouh-refactor-use-textractor-mtchoun-mouh.mongulu.cm.s3-website.eu-central-1.amazonaws.com"

```

</details>

<!-- github-comment: {"Command":"apply","JobName":"deploy","PRNumber":186,"Program":"tfcmt","SHA1":"2b8d48a319fed9ff3f3047d78760cb4220eb11bc","Vars":{},"WorkflowName":"Deploy cases"} -->